ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_tzc_sec.c
    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_OCRAM_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 20);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_OCRAM_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set OCRAM regionx access configuration
 *
 * @param  group: OCRAM region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_OCRAM_Access_Set_Regionx(uint8_t group)
{
    uint32_t tmpVal = 0;
    uint8_t region = 3;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_OCRAM_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 4)));
    tmpVal |= (group << (region * 4));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_OCRAM_TZSRG_CTRL, tmpVal);

    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_OCRAM_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 20);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_OCRAM_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set WRAM region access configuration
 *
 * @param  region: WRAM region index 0-2
 * @param  startAddr: WRAM region start address
 * @param  endAddr: WRAM region end address
 * @param  group: WRAM region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_WRAM_Access_Set_Advance(uint8_t region, uint32_t startAddr, uint32_t endAddr, uint8_t group)
{
    uint32_t tmpVal = 0;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (region >= 3) {
        return;
    }
    group = group & 0xf;

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 4)));
    tmpVal |= (group << (region * 4));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL, tmpVal);

    tmpVal = (((endAddr >> 10) & 0xffff) - 1) | (((startAddr >> 10) & 0xffff) << 16);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_WRAM_TZSRG_R0_OFFSET + region * 4, tmpVal);

    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 20);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set WRAM regionx access configuration
 *
 * @param  group: WRAM region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_WRAM_Access_Set_Regionx(uint8_t group)
{
    uint32_t tmpVal = 0;
    uint8_t region = 3;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 4)));
    tmpVal |= (group << (region * 4));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL, tmpVal);

    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 20);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_WRAM_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set Flash region access configuration
 *
 * @param  region: Flash region index 0-2
 * @param  startAddr: Flash region start address
 * @param  endAddr: Flash region end address
 * @param  group: Flash region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_Flash_Access_Set(uint8_t region, uint32_t startAddr, uint32_t endAddr, uint8_t group)
{
    uint32_t tmpVal = 0;
    uint32_t tmpVal2 = 0;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (region >= 4 || group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 4)));
    tmpVal |= (group << (region * 4));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL, tmpVal);

    /* Set range */
    tmpVal = (((endAddr >> 10) & 0xffff) - 1) | (((startAddr >> 10) & 0xffff) << 16);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_SF_TZSRG_R0_OFFSET + region * 4, tmpVal);

    /* Set range MSB */
    tmpVal = BL_RD_WORD(TZC_SEC_BASE + TZC_SEC_TZC_SF_TZSRG_MSB_OFFSET);
    tmpVal = tmpVal & (0xff << (8 * group));
    tmpVal2 = ((endAddr >> 26) & 0x7) | (((startAddr >> 26) & 0x7) << 3);
    tmpVal2 = tmpVal2 << (8 * group);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_SF_TZSRG_MSB_OFFSET, tmpVal | tmpVal2);

    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL);
    tmpVal |= 1 << (region + 20);
    tmpVal |= 1 << (region + 25);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set Flash regionx access configuration
 *
 * @param  group: Flash region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_Flash_Access_Set_Regionx(uint8_t group)
{
    uint32_t tmpVal = 0;
    uint8_t region = 4;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 4)));
    tmpVal |= (group << (region * 4));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL, tmpVal);

