ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_tzc_sec.c
    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL);
    tmpVal |= 1 << (region + 20);
    tmpVal |= 1 << (region + 25);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_SF_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set L2SRAM region access configuration
 *
 * @param  region: L2SRAM region index 0-2
 * @param  startAddr: L2SRAM region start address
 * @param  endAddr: L2SRAM region end address
 * @param  group: L2SRAM region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_L2SRAM_Access_Set(uint8_t region, uint32_t startAddr, uint32_t endAddr, uint8_t group)
{
    uint32_t tmpVal = 0;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (region >= 3 || group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_L2SRAM_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 2)));
    tmpVal |= (group << (region * 2));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_L2SRAM_TZSRG_CTRL, tmpVal);

    tmpVal = (((endAddr >> 10) & 0xffff) - 1) | (((startAddr >> 10) & 0xffff) << 16);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_L2SRAM_TZSRG_R0_OFFSET + region * 4, tmpVal);

    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_L2SRAM_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 24);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_L2SRAM_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set VRAM region access configuration
 *
 * @param  region: VRAM region index 0-2
 * @param  startAddr: VRAM region start address
 * @param  endAddr: VRAM region end address
 * @param  group: VRAM region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_VRAM_Access_Set(uint8_t region, uint32_t startAddr, uint32_t endAddr, uint8_t group)
{
    uint32_t tmpVal = 0;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (region >= 3 || group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_VRAM_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 2)));
    tmpVal |= (group << (region * 2));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_VRAM_TZSRG_CTRL, tmpVal);

    tmpVal = (((endAddr >> 10) & 0xffff) - 1) | (((startAddr >> 10) & 0xffff) << 16);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_VRAM_TZSRG_R0_OFFSET + region * 4, tmpVal);

    /* set enable lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_VRAM_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 24);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_VRAM_TZSRG_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TrustZone Security set PSRAMA region access configuration
 *
 * @param  region: PSRAMA region index 0-2
 * @param  startAddr: PSRAMA region start address
 * @param  endAddr: PSRAMA region end address
 * @param  group: PSRAMA region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_PSRAMA_Access_Set(uint8_t region, uint32_t startAddr, uint32_t endAddr, uint8_t group)
{
    uint32_t tmpVal = 0;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (region >= 3 || group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMA_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 2)));
    tmpVal |= (group << (region * 2));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMA_TZSRG_CTRL, tmpVal);

    tmpVal = (((endAddr >> 10) & 0xffff) - 1) | (((startAddr >> 10) & 0xffff) << 16);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_PSRAMA_TZSRG_R0_OFFSET + region * 4, tmpVal);

    /* set enable and lock */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMA_TZSRG_CTRL);
    tmpVal |= 1 << (region + 16);
    tmpVal |= 1 << (region + 24);
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMA_TZSRG_CTRL, tmpVal);
}
/**
 * @brief TrustZone Security set Release PSRAMA region access
 *
 */
void Tzc_Sec_PSRAMA_Access_Release(void)
{
    uint32_t tmpVal = 0;
    uint32_t region = 0;
    /* set disable */
    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMA_TZSRG_CTRL);
    tmpVal &= (~(1 << (region + 16)));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMA_TZSRG_CTRL, tmpVal);
}
/****************************************************************************/ /**
 * @brief  TrustZone Security set PSRAMB region access configuration
 *
 * @param  region: PSRAMB region index 0-2
 * @param  startAddr: PSRAMB region start address
 * @param  endAddr: PSRAMB region end address
 * @param  group: PSRAMB region auth group type
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_PSRAMB_Access_Set(uint8_t region, uint32_t startAddr, uint32_t endAddr, uint8_t group)
{
    uint32_t tmpVal = 0;

    /* check the parameter */
    CHECK_PARAM(IS_TZC_SEC_GROUP_TYPE(group));
    if (region >= 3 || group > TZC_SEC_MAX_AUTH_GRP) {
        return;
    }
    group = 1 << (group);

    tmpVal = BL_RD_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMB_TZSRG_CTRL);
    tmpVal &= (~(3 << (region * 2)));
    tmpVal |= (group << (region * 2));
    BL_WR_REG(TZC_SEC_BASE, TZC_SEC_TZC_PSRAMB_TZSRG_CTRL, tmpVal);

    tmpVal = (((endAddr >> 10) & 0xffff) - 1) | (((startAddr >> 10) & 0xffff) << 16);
    BL_WR_WORD(TZC_SEC_BASE + TZC_SEC_TZC_PSRAMB_TZSRG_R0_OFFSET + region * 4, tmpVal);

